export const Test = () => {
   return (
      <>
         <p className="mb-2 indent-10 text-white">
            {
               'โค้ดนี้เป็นการใช้งานโมดูล re ของ Python ในการค้นหาตัวอักษรที่ตรงกับรูปแบบที่กำหนดไว้ใน pattern ซึ่งในที่นี้คือ <b>"< main[-￿]*id="ดูเพิ่ม">ดูเพิ่ม</span>"</b> ในตัวแปร data.text'
            }
         </p>
         <p className="mb-2 indent-10 text-white">
            {
               'โดย re.compile() เป็นฟังก์ชันที่ใช้ในการแปลงรูปแบบที่ต้องการค้นหาเป็น pattern ที่สามารถใช้งานได้กับฟังก์ชัน re.findall() เพื่อค้นหาตัวอักษรตาม pattern ที่กำหนดไว้ในข้อมูลที่เก็บไว้ในตัวแปร data.text'
            }
         </p>
         <p className="indent-10 text-white">
            {
               'ผลลัพธ์ที่ได้จะถูกเก็บไว้ในตัวแปร result ซึ่งเป็น list ของข้อความที่ตรงกับ pattern ที่ค้นหาได้ในข้อมูล data.text โดยในที่นี้เป็นข้อความ "< main id="ดูเพิ่ม">ดูเพิ่ม</span>" ที่ตรงกับ pattern ที่กำหนดไว้'
            }
         </p>
      </>
   );
};

export const Test2 = () => {
   return (
      <>
         <p className="mb-3 indent-10 text-white tracking-wide">
            โค้ดนี้เขียนด้วยภาษา Python และใช้คำสั่ง await เพื่อรอรับผลลัพธ์จากการเรียกใช้ฟังก์ชัน
            fetch ซึ่งอาจจะเป็นการเรียกใช้ API หรือเว็บไซต์อื่น ๆ โดยตัวแปร url จะเป็น URL
            ของที่อยู่ของ API หรือเว็บไซต์ที่ต้องการเรียกใช้งาน
         </p>
         <p className="indent-10 text-white tracking-wide">
            การใช้คำสั่ง await เป็นการรอผลลัพธ์จากฟังก์ชัน fetch
            ซึ่งอาจจะใช้เวลานานในการดึงข้อมูลจากเว็บไซต์หรือ API ที่ถูกเรียกใช้
            และในขณะนี้โปรแกรมจะหยุดการทำงานของโค้ดบรรทัดนี้จนกว่าฟังก์ชัน fetch จะส่งผลลัพธ์กลับมา
            โดยผลลัพธ์ที่ส่งกลับมาอาจจะเป็นข้อมูลในรูปแบบต่าง ๆ เช่น ข้อความ รูปแบบ JSON
            หรือไฟล์อื่น ๆ ซึ่งจะถูกเก็บไว้ในตัวแปร data ซึ่งจะนำไปใช้งานต่อไปในโปรแกรมของเราได้
         </p>
      </>
   );
};
